/*
********************************************************************************
*                            中国自主物联网操作系统
*                            Thread Operating System
*
*                              主芯片:STM32F411re/cc
*
*                               移植/裁剪：郭良志
********************************************************************************
*文件名     : device_adc.h
*作用       : 模数转换配置
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz         2016/12/14        初始版本
********************************************************************************
*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DEVICE_ADC__H
#define __DEVICE_ADC__H

/* Includes ------------------------------------------------------------------*/
#include "system.h"






/* Exported functions ------------------------------------------------------- */
void Adc_init(void);
uint16_t GetAdcValue(uint8_t ch);
void AdcSystick100Routine(void);



#endif /* __DEVICEUART__H */
