/*
********************************************************************************
*                            中国自主物联网操作系统
*                            Thread Operating System
*
*                              主芯片:STM32F401re
*
********************************************************************************
*文件名     : device_spi.h
*作用       : spi设备
********************************************************************************
*版本     作者            日期            说明
*V0.1    Guolz         2016/12/14        初始版本
********************************************************************************
*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef DEVICE_SPI_H_
#define DEVICE_SPI_H_

#include "stdint.h"



void SPI1_init(uint16_t speed_set);
uint8_t SPI1_ReadWriteByte(uint8_t TxData);


#endif /* DEVICE_SPI_H_ */

